Repository: jameshilliard/acs-GPL-3.3.0
Catalog: tarbal/diffutils-2.8.7/po/*.po
Languages: ro

source: program error
ro: eroare de program

source: stack overflow
ro: stivã plinã(overflow)

source: Unknown system error
ro: Eroare de sistem necunoscutã

source: regular empty file
ro: fiºier obiºnuit(regular) vid

source: regular file
ro: fiºier obiºnuit

source: directory
ro: director

source: block special file
ro: fiºier bloc special

source: character special file
ro: fiºier caracter special

source: symbolic link
ro: legãturã simbolicã

source: message queue
ro: coadã(queue) de mesaje

source: semaphore
ro: semafor

source: shared memory object
ro: obiect memorie globalã(shared memory)

source: weird file
ro: fiºier ciudat

source: %s: option `%s' is ambiguous
ro: %s: opþiunea `%s' este ambiguã

source: %s: option `--%s' doesn't allow an argument
ro: %s: opþiunea `--%s' nu permite parametri

source: %s: option `%c%s' doesn't allow an argument
ro: %s: opþiunea `%c%s' nu permite parametri

source: %s: option `%s' requires an argument
ro: %s: opþiunea `%s' necesitã un parametru

source: %s: unrecognized option `--%s'
ro: %s: opþiune necunoscutã `--%s'

source: %s: unrecognized option `%c%s'
ro: %s: opþiune necunoscutã `%c%s'

source: %s: illegal option -- %c
ro: %s: opþiune ilegalã -- %c

source: %s: invalid option -- %c
ro: %s: opþiune invalidã -- %c

source: %s: option requires an argument -- %c
ro: %s: opþiunea necesitã un parametru -- %c

source: %s: option `-W %s' is ambiguous
ro: %s: opþiunea `-W %s' este ambiguã

source: %s: option `-W %s' doesn't allow an argument
ro: %s: opþiunea `-W %s' nu permite parametri

source: Success
ro: Succes

source: No match
ro: Nici o potrivire

source: Invalid regular expression
ro: Expresie normalã(regular) invalidã

source: Invalid collation character
ro: Caracter de comparare invalid

source: Invalid character class name
ro: Nume clasã caracter invalidã

source: Trailing backslash
ro: Backslash de sfârºit de linie(trailing)

source: Invalid back reference
ro: Referinþã precedentã invalidã

source: Unmatched [ or [^
ro: [ sau [^ neînchise

source: Unmatched ( or \(
ro: ( or \( neînchise

source: Unmatched \{
ro: \{ neînchisã

source: Invalid content of \{\}
ro: Conþinut invalid al \{\}

source: Invalid range end
ro: Sfârºit de domeniu invalid

source: Memory exhausted
ro: Memorie plinã

source: Invalid preceding regular expression
ro: Expresie normalã de precedenþã invalidã

source: Premature end of regular expression
ro: Sfârºit prematur de expresie normalã

source: Regular expression too big
ro: Expresie normalã prea mare

source: Unmatched ) or \)
ro: ) or \) nedeschise

source: No previous regular expression
ro: Nu a existat nici o expresie normalã antecedentã

source: memory exhausted
ro: memorie plinã

source: Files %s and %s differ
ro: Fiºierele %s ºi %s diferã

source: No newline at end of file
ro: Nici un element de linie nouã la sfârºitul fiºierului

source: Try `%s --help' for more information.
ro: Încercaþi `%s --help' pentru mai multe informaþii.

source: invalid --ignore-initial value `%s'
ro: invalid --se ignorã valoarea iniþialã `%s'

source: options -l and -s are incompatible
ro: opþiunile -l ºi -s sunt incompatibile

source: write failed
ro: scriere eºuatã

source: standard output
ro: ieºire(output) standard

source: -b --print-bytes Print differing bytes.
ro: -b --print-bytes Tipãreºte octeþii diferiþi.

source: -i SKIP --ignore-initial=SKIP Skip the first SKIP bytes of input.
ro: -i OMIS --ignore-initial=OMIS Omite primii octeþi OMISi din intrare(input).

source: -i SKIP1:SKIP2 --ignore-initial=SKIP1:SKIP2
ro: -i OMIS1:OMIS2 --ignore-initial=OMIS1:OMIS2

source: Skip the first SKIP1 bytes of FILE1 and the first SKIP2 bytes of FILE2.
ro: Omite primii OMIS1 octeþi din FIªIER1 ºi primii OMIS2 octeþi din FIªIER2

source: -l --verbose Output byte numbers and values of all differing bytes.
ro: -l --verbose Tipãreºte numerele octeþilor ºi valorile octeþilor diferiþi.

source: -n LIMIT --bytes=LIMIT Compare at most LIMIT bytes.
ro: -n LIMITÃ --bytes=LIMITÃ Comparã cel mult LIMITÃ octeþi.

source: -s --quiet --silent Output nothing; yield exit status only.
ro: -s --quiet --silent Nu tipãreºte nimic; anunþã(yield) doar starea de ieºire.

source: -v --version Output version info.
ro: -v --version Tipãreºte informaþii despre versiune.

source: --help Output this help.
ro: --help Tipãreºte acest ajutor.

source: Usage: %s [OPTION]... FILE1 [FILE2 [SKIP1 [SKIP2]]]
ro: Folosire: %s [OPÞIUNE]... FIªIER1 [FIªIER2 [OMIS1 [OMIS2]]]

source: Compare two files byte by byte.
ro: Comparã douã fiºiere octet cu octet.

source: SKIP1 and SKIP2 are the number of bytes to skip in each file.
ro: OMIS1 ºi OMIS2 sunt numerele de octeþi care sã fie omiºi din fiecare fiºier.

source: SKIP values may be followed by the following multiplicative suffixes: kB 1000, K 1024, MB 1,000,000, M 1,048,576, GB 1,000,000,000, G 1,073,741,824, and so on for T, P, E, Z, Y.
ro: Valorile OMIS pot fi urmate de urmãtoarele sufixe multiplicative: kB 1000, K 1024, MB 1,000,000, M 1,048,576, GB 1,000,000,000, G 1,073,741,824, ºi aºa mai departe pentru T, P, E, Z, Y.

source: If a FILE is `-' or missing, read standard input.
ro: Dacã un FIªIER este `-' sau lipseºte, se citeºte intrarea(input) standard.

source: Report bugs to <bug-gnu-utils@gnu.org>.
ro: Raportaþi erorile(bugs)la <bug-gnu-utils@gnu.org>.

source: invalid --bytes value `%s'
ro: valoare --bytes invalidã `%s'

source: missing operand after `%s'
ro: lipseºte operandul dupã `%s'

source: extra operand `%s'
ro: operand în plus(extra) `%s'

source: %s %s differ: byte %s, line %s
ro: %s %s diferã: octetul %s, linia %s

source: %s %s differ: byte %s, line %s is %3o %s %3o %s
ro: %s %s diferã: octetul %s, linia %s este %3o %s %3o %s

source: cmp: EOF on %s
ro: cmp: EOF în %s

source: invalid context length `%s'
ro: lungime invalidã de context `%s'

source: pagination not supported on this host
ro: paginaþie nesuportatã de acest host

source: too many file label options
ro: prea multe opþiuni de etichete fiºier

source: invalid width `%s'
ro: lungime invalidã `%s'

source: conflicting width options
ro: opþiuni de lungime în conflict

source: invalid horizon length `%s'
ro: lungime de orizont invalidã `%s'

source: invalid tabsize `%s'
ro: mãrime tab invalidã `%s'

source: conflicting tabsize options
ro: opþiuni mãrime tab în conflict

source: `-%ld' option is obsolete; use `-%c %ld'
ro: `-%ld' opþiunea este învechitã; folosiþi `-%c %ld'

source: `-%ld' option is obsolete; omit it
ro: `-%ld' opþiunea este învechitã; omiteþi-o

source: --from-file and --to-file both specified
ro: --from-file ºi --to-file sunt specificate împreunã

source: Compare files line by line.
ro: Comparã fiºierele linie cu linie.

source: -i --ignore-case Ignore case differences in file contents.
ro: -i --ignore-case Ignorã diferenþele de caz din conþinutul fiºierului.

source: --ignore-file-name-case Ignore case when comparing file names.
ro: --ignore-file-name-case Ignorã cazul când se comparã numele de fiºiere.

source: --no-ignore-file-name-case Consider case when comparing file names.
ro: --no-ignore-file-name-case Ia în calcul cazul atunci când se comparã numele de fiºiere.

source: -E --ignore-tab-expansion Ignore changes due to tab expansion.
ro: -E --ignore-tab-expansion Ignorã schimbãrile produse de modificarea tab-ului.

source: -b --ignore-space-change Ignore changes in the amount of white space.
ro: -b --ignore-space-change Ignorã schimbãrile din spaþiul vid.

source: -w --ignore-all-space Ignore all white space.
ro: -w --ignore-all-space Ignorã tot spaþiul vid.

source: -B --ignore-blank-lines Ignore changes whose lines are all blank.
ro: -B --ignore-blank-lines Ignorã schimbãrile unde toate liniile sunt goale(blank).

source: -I RE --ignore-matching-lines=RE Ignore changes whose lines all match RE.
ro: -I RE --ignore-matching-lines=RE Ignorã schimbãrile la toate liniile care se potrivesc RE-ului.

source: --strip-trailing-cr Strip trailing carriage return on input.
ro: --strip-trailing-cr Eliminã returul de car(carriage return) final la intrare(input).

source: --binary Read and write data in binary mode.
ro: --binary Citeºte ºi scrie date în mod binar.

source: -a --text Treat all files as text.
ro: -a --text Trateazã toate fiºierele ca text.

source: -c -C NUM --context[=NUM] Output NUM (default 3) lines of copied context. -u -U NUM --unified[=NUM] Output NUM (default 3) lines of unified context. --label LABEL Use LABEL instead of file name. -p --show-c-function Show which C function each change is in. -F RE --show-function-line=RE Show the most recent line matching RE.
ro: -c -C NUM --context[=NUM] Tipãreºte NUM (implicit 3) linii de contextcopiat. -u -U NUM --unified[=NUM] Tipãreºte NUM (implicit 3) linii de contextunificat. --label ETICHETÃ Foloseºte ETICHETÃ în loc de nume fiºier. -p --show-c-function Afiºeazã fiecare schimbare din fiecare funcþie C. -F RE --show-function-line=RE Afiºeazã cele mai recente linii care se potrivesc RE.

source: -q --brief Output only whether files differ.
ro: -q --brief Afiºeazã doar dacã fiºierele diferã.

source: -e --ed Output an ed script.
ro: -e --ed Afiºeazã un script ed.

source: --normal Output a normal diff.
ro: --normal Afiºeazã un diff normal.

source: -n --rcs Output an RCS format diff.
ro: -n --rcs Afiºeazã un diff în format RCS.

source: -y --side-by-side Output in two columns. -W NUM --width=NUM Output at most NUM (default 130) print columns. --left-column Output only the left column of common lines. --suppress-common-lines Do not output common lines.
ro: -y --side-by-side Afiºeazã pe douã coloane. -W NUM --width=NUM Afiºeazã cel mult NUM (implicit 130) coloane tipãrite. --left-column Afiºeazã doar coloana din stânga a liniilor comune. --suppress-common-lines Nu afiºa liniile comune.

source: -D NAME --ifdef=NAME Output merged file to show `#ifdef NAME' diffs.
ro: -D NUME --ifdef=NUME Afiºeazã fiºierul rezultat(merged) pentru a arãta diff-urile`#ifdef NAME'.

source: --GTYPE-group-format=GFMT Similar, but format GTYPE input groups with GFMT.
ro: --GTYPE-group-format=GFMT Similar, dar formatul de intrare GTYPE se grupeazã cu GFMT.

source: --line-format=LFMT Similar, but format all input lines with LFMT.
ro: --line-format=LFMT Similar, dar formateazã toate liniile cu LFMT.

source: --LTYPE-line-format=LFMT Similar, but format LTYPE input lines with LFMT.
ro: --LTYPE-line-format=LFMT Similar, dar formateazã liniile de intrare LTYPE cu LFMT.

source: LTYPE is `old', `new', or `unchanged'. GTYPE is LTYPE or `changed'.
ro: LTYPE este `old', `new', sau `unchanged'. GTYPE este LTYPE sau `changed'.

source: GFMT may contain: %< lines from FILE1 %> lines from FILE2 %= lines common to FILE1 and FILE2 %[-][WIDTH][.[PREC]]{doxX}LETTER printf-style spec for LETTER LETTERs are as follows for new group, lower case for old group: F first line number L last line number N number of lines = L-F+1 E F-1 M L+1
ro: GFMT poate conþine: %< linii din FIªIER1 %> linii din FIªIER2 %= linii comune lui FIªIER1 si FIªIER2 %[-][WIDTH][.[PREC]]{doxX}LETTER specificaþii stil printf pentru LETTER LETTERs sunt dupã cum urmeazã pentru grup nou, literã micã pentru grup vechi: F primul numãr de linie L ultimul numãr de linie N numere de linii = L-F+1 E F-1 M L+1

source: LFMT may contain: %L contents of line %l contents of line, excluding any trailing newline %[-][WIDTH][.[PREC]]{doxX}n printf-style spec for input line number
ro: LFMT poate conþine: %L conþinut de linie %l conþinut de linie, excluzând orice caracter de linie nouã final %[-][WIDTH][.[PREC]]{doxX}n specificaþii stil printf-pentru introducerea numãrului de linie

source: Either GFMT or LFMT may contain: %% % %c'C' the single character C %c'\OOO' the character with octal code OOO
ro: Una din GFMT sau LFMT poate conþine: %% % %c'C' caracterul singular C %c'\OOO' caracterul cu codul octal OOO

source: -l --paginate Pass the output through `pr' to paginate it.
ro: -l --paginate Trimite ieºirea(output) prin `pr' pentru a fi paginatã.

source: -t --expand-tabs Expand tabs to spaces in output.
ro: -t --expand-tabs Schimbã tab-urile în spaþii la ieºire(output).

source: -T --initial-tab Make tabs line up by prepending a tab.
ro: -T --initial-tab Aliniazã tab-urile adãugând în faþã un tab.

source: --tabsize=NUM Tab stops are every NUM (default 8) print columns.
ro: --tabsize=NUM Opririle tab-ului vor fi la fiecare NUM (implicit 8) coloane tipãrite.

source: -r --recursive Recursively compare any subdirectories found.
ro: -r --recursive Comparã recursiv orice subdirector întâlnit.

source: -N --new-file Treat absent files as empty.
ro: -N --new-file Trateazã fiºierele lipsã ca vide.

source: --unidirectional-new-file Treat absent first files as empty.
ro: --unidirectional-new-file Trateazã primele fiºiere lipsã ca vide.

source: -s --report-identical-files Report when two files are the same.
ro: -s --report-identical-files Raporteazã când douã fiºiere sunt asemãnãtoare.

source: -x PAT --exclude=PAT Exclude files that match PAT.
ro: -x TIP --exclude=TIP Exclude fiºierele care se potrivesc TIParului.

source: -X FILE --exclude-from=FILE Exclude files that match any pattern in FILE.
ro: -X FIªIER --exclude-from=FIªIER Exclude fiºierele care se potrivesc oricãrui tipar din FIªIER.

source: -S FILE --starting-file=FILE Start with FILE when comparing directories.
ro: -S FIªIER --starting-file=FIªIER Începe cu FIªIER în compararea directoarelor.

source: --from-file=FILE1 Compare FILE1 to all operands. FILE1 can be a directory.
ro: --from-file=FIªIER1 Comparã FIªIER1 cu toþi operanzii. FIªIER1 poate fi director.

source: --to-file=FILE2 Compare all operands to FILE2. FILE2 can be a directory.
ro: --to-file=FIªIER2 Comparã toþi operanzii cu FIªIER2. FIªIER2 poate fi director.

source: --horizon-lines=NUM Keep NUM lines of the common prefix and suffix.
ro: --horizon-lines=NUM Reþine NUM linii de prefix ºi sufix comun.

source: -d --minimal Try hard to find a smaller set of changes.
ro: -d --minimal Încearcã din greu sã gãseºti un set mai mic de schimbãri

source: --speed-large-files Assume large files and many scattered small changes.
ro: --speed-large-files Presupune fiºiere mari ºi multe modificãri mici împrãºtiate.

source: FILES are `FILE1 FILE2' or `DIR1 DIR2' or `DIR FILE...' or `FILE... DIR'.
ro: FIªIEREle sunt `FIªIER1 FIªIER2' sau `DIR1 DIR2' sau `DIR FIªIER...' or `FIªIER... DIR'.

source: If --from-file or --to-file is given, there are no restrictions on FILES.
ro: Dacã --from-file sau --to-file sunt precizate, nu existã restricþii pe FIªIERE.

source: If a FILE is `-', read standard input.
ro: Dacã FIªIER este `-', se citeºte intrarea(input) standard.

source: Usage: %s [OPTION]... FILES
ro: Folosire: %s [OPÞIUNE]... FIªIERE

source: conflicting %s option value `%s'
ro: Existã un conflict cu %s în valoarea opþiunii `%s'

source: conflicting output style options
ro: Conflict în opþiunile stilului de afiºare(output)

source: Only in %s: %s
ro: Doar în %s: %s

source: cannot compare `-' to a directory
ro: nu se poate compara `-' cu un director

source: -D option not supported with directories
ro: opþiunea -D nu este compatibilã cu directoarele

source: Common subdirectories: %s and %s
ro: Subdirectoare comune: %s ºi %s.

source: File %s is a %s while file %s is a %s
ro: Fiºierul %s este un %s pe când fiºierul %s este un %s.

source: Files %s and %s are identical
ro: Fiºierele %s ºi %s sunt identice

source: incompatible options
ro: opþiuni incompatibile

source: `-' specified for more than one input file
ro: `-' specificat pentru mai mult de un fiºier de intrare(input)

source: read failed
ro: citire eºuatã

source: -e --ed Output unmerged changes from OLDFILE to YOURFILE into MYFILE.
ro: -e --ed Trimite(output) modificãrile nerezultate(unmerged) de la FIªIER_VECHI la FIªIERUL_VOSTRU în FIªIERUL_MEU..

source: -E --show-overlap Output unmerged changes, bracketing conflicts.
ro: -E --show-overlap Afiºeazã modificãrile nerezultate(unmerged), conflictele de paranteze.

source: -A --show-all Output all changes, bracketing conflicts.
ro: -A --show-all Afiºeazã toate modificãrile, conflictele de paranteze.

source: -x --overlap-only Output overlapping changes.
ro: -x --overlap-only Afiºeazã toate schimbãrile de suprapunere.

source: -X Output overlapping changes, bracketing them.
ro: -X Afiºeazã schimbãrile de suprapunere, punându-le în paranteze.

source: -3 --easy-only Output unmerged nonoverlapping changes.
ro: -3 --easy-only Afiºeazã schimbãrile nesuprapuse(nonoverlapping) ºi nerezultate(unmerged).

source: -m --merge Output merged file instead of ed script (default -A).
ro: -m --merge Afiºeazã fiºierul rezultat(merged) în loc de scriputl ed (implicit -A).

source: -L LABEL --label=LABEL Use LABEL instead of file name.
ro: -L ETICHETÃ --label=ETICHETÃ Foloseºte ETICHETÃ în loc de numele fiºierului.

source: -i Append `w' and `q' commands to ed scripts.
ro: -i Adaugã comenzile `w' ºi `q' la scripturile ed.

source: --diff-program=PROGRAM Use PROGRAM to compare files.
ro: --diff-program=PROGRAM Foloseºte PROGRAM pentru a compara fiºierele.

source: Usage: %s [OPTION]... MYFILE OLDFILE YOURFILE
ro: Folosire: %s [OPÞIUNE]... FIªIERUL_MEU FIªIER_VECHI FIªIERUL_TÃU

source: Compare three files line by line.
ro: Comparã trei fiºiere linie cu linie

source: internal error: screwup in format of diff blocks
ro: eroare internã: zãpãcealã în formatul blocurilor diff

source: %s: diff failed:
ro: %s: diff eºuat:

source: internal error: invalid diff type in process_diff
ro: eroare internã: tip diff invalid în process_diff

source: invalid diff format; invalid change separator
ro: format diff invalid; separator de modificare invalid

source: invalid diff format; incomplete last line
ro: format diff invalid; ultimã-linie incompletã

source: subsidiary program `%s' not found
ro: programul subsidiar `%s' nu a fost gãsit

source: subsidiary program `%s' failed
ro: programul subsidiar `%s' eºuat

source: invalid diff format; incorrect leading line chars
ro: format diff invalid; caractere precedente liniei incorecte

source: internal error: invalid diff type passed to output
ro: eroare internã: tip invalid de diff trimis spre ieºire(output)

source: input file shrank
ro: fiºier de intrare(input) micºorat

source: cannot compare file names `%s' and `%s'
ro: nu se pot compara numele de fiºiere `%s' ºi `%s'

source: -o FILE --output=FILE Operate interactively, sending output to FILE.
ro: -o FIªIER --output=FIªIER Opereazã interactiv, trimiþând outputul spre FIªIER.

source: -i --ignore-case Consider upper- and lower-case to be the same.
ro: -i --ignore-case Considerã majusculele ºi minusculele ca fiind aceleaºi.

source: -W --ignore-all-space Ignore all white space.
ro: -W --ignore-all-space Ignorã tot spaþiul gol.

source: -w NUM --width=NUM Output at most NUM (default 130) print columns.
ro: -w NUM --width=NUM Afiºeazã cel mult NUM (implicit 130) coloane tipãrite.

source: -l --left-column Output only the left column of common lines.
ro: -l --left-column Afiºeazã doar coloana din stânga a liniilor comune.

source: -s --suppress-common-lines Do not output common lines.
ro: -s --suppress-common-lines Nu afiºa liniile comune.

source: -H --speed-large-files Assume large files and many scattered small changes.
ro: -H --speed-large-files Presupune fiºiere mari ºi multe modificãri mici împrãºtiate.

source: Usage: %s [OPTION]... FILE1 FILE2
ro: Folosire: %s [OPÞIUNE]... FIªIER1 FIªIER2

source: Side-by-side merge of file differences.
ro: Analizã pas cu pas a diferenþelor de fiºiere.

source: cannot interactively merge standard input
ro: nu poate rezulta(merge) interactiv intrarea(input) standard

source: both files to be compared are directories
ro: ambele fiºiere de comparat sunt directoare

source: ed: Edit then use both versions, each decorated with a header. eb: Edit then use both versions. el: Edit then use the left version. er: Edit then use the right version. e: Edit a new version. l: Use the left version. r: Use the right version. s: Silently include common lines. v: Verbosely include common lines. q: Quit.
ro: ed: Editeazã apoi foloseºte ambele versiuni, fiecare decoratã cu un cap de tabel. eb: Editeazã apoi foloseºte ambele versiuni. el: Editeazã apoi foloseºte versiunea din stânga. er: Editeazã apoi foloseºte versiunea din dreapta. e: Editeazã o versiune nouã. l: Foloseºte versiunea din stânga. r: Foloseºte versiunea din dreapta. s: Include silenþios liniile comune. v: Include detaliat liniile comune. q: Ieºire.
